referred_org_map = {
    "Государственное Бюджетное Учреждение Здравоохранения  Малгобекская Центральная Районная Больница": {
        "code": "00061700000000000",
        "name": 'ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "МАЛГОБЕКСКАЯ ЦЕНТРАЛЬНАЯ РАЙОННАЯ БОЛЬНИЦА"',
        "nick": 'ГБУЗ "МЦРБ"',
        "token": '1.2.643.5.1.13.13.12.2.6.487'
    },
    "ФГБУЗ  ЦМСЧ№120 ФИЛИАЛ МСЧ№6": {
        'code': '00556904000000067',
        'name': 'ФИЛИАЛ "МЕДИКО-САНИТАРНАЯ ЧАСТЬ № 6" ФЕДЕРАЛЬНОГО ГОСУДАРСТВЕННОГО БЮДЖЕТНОГО УЧРЕЖДЕНИЯ ЗДРАВООХРАНЕНИЯ "ЦЕНТРАЛЬНАЯ МЕДИКО-САНИТАРНАЯ ЧАСТЬ № 120 ФЕДЕРАЛЬНОГО МЕДИКО-БИОЛОГИЧЕСКОГО АГЕНТСТВА"',
        'nick': 'Филиал "МСЧ № 6" ФГБУЗ ЦМСЧ № 120 ФМБА России',
        'token': '1.2.643.5.1.13.13.12.2.51.9750'
    },
    'ГОБУЗ МУРМАНСКАЯ ГОРОДСКАЯ ДЕТСКАЯ ПОЛИКЛИНИКА № 5': {
        'code': '00559800000000000',
        'name': 'ГОСУДАРСТВЕННОЕ ОБЛАСТНОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "МУРМАНСКАЯ ГОРОДСКАЯ ДЕТСКАЯ ПОЛИКЛИНИКА № 5"',
        'nick': 'ГОБУЗ "МГДП № 5"',
        'token': '1.2.643.5.1.13.13.12.2.51.4961'
    },
    'ФГБУЗ МСЧ 118 ФМБА': {
        'code': '00556800000000000',
        'name': 'ФЕДЕРАЛЬНОЕ ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "МЕДИКО-САНИТАРНАЯ ЧАСТЬ № 118 ФЕДЕРАЛЬНОГО МЕДИКО-БИОЛОГИЧЕСКОГО АГЕНТСТВА"',
        'nick': 'ФГБУЗ МСЧ № 118 ФМБА РОССИИ',
        'token': '1.2.643.5.1.13.13.12.2.51.4990'
    },
    "МГДП № 1 г МУРМАНСК": {
        'code': '00559000000000000',
        'name': 'ГОСУДАРСТВЕННОЕ ОБЛАСТНОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "МУРМАНСКАЯ ГОРОДСКАЯ ДЕТСКАЯ ПОЛИКЛИНИКА № 1"',
        'nick': 'ГОБУЗ "МГДП № 1"',
        'token': '1.2.643.5.1.13.13.12.2.51.4992'
    },
    "ГО БУЗ МУРМАНСКАЯ ГДП 1": {
        'code': '00559000000000000',
        'name': 'ГОСУДАРСТВЕННОЕ ОБЛАСТНОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "МУРМАНСКАЯ ГОРОДСКАЯ ДЕТСКАЯ ПОЛИКЛИНИКА № 1"',
        'nick': 'ГОБУЗ "МГДП № 1"',
        'token': '1.2.643.5.1.13.13.12.2.51.4992'
    },
    "ГОБУЗ Кольская ЦРБ Мурманская область": {
        'code': '00556100000000000',
        'name': 'ГОСУДАРСТВЕННОЕ ОБЛАСТНОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "КОЛЬСКАЯ ЦЕНТРАЛЬНАЯ РАЙОННАЯ БОЛЬНИЦА"',
        'nick': 'ГОБУЗ "КОЛЬСКАЯ ЦРБ"',
        'token': '1.2.643.5.1.13.13.12.2.51.4987'
    },
    "ГБУЗ СК ГОРОДСКАЯ ПОЛИКЛИНИКА 2": {  # ставропольская поликлиника?
        'code': '00275400000000000',
        'name': 'ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ СТАВРОПОЛЬСКОГО КРАЯ "ГОРОДСКАЯ ПОЛИКЛИНИКА № 2" ГОРОДА СТАВРОПОЛЯ',
        'nick': 'ГБУЗ СК "ГОРОДСКАЯ ПОЛИКЛИНИКА № 2" Г.СТАВРОПОЛЯ',
        'token': '1.2.643.5.1.13.13.12.2.26.2510'
    },
    "ФЕДЕРАЛЬНОЕ ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ НАУКИ ФЕДЕРАЛЬНЫЙ ИССЛЕДОВАТЕЛЬСКИЙ ЦЕНТР \"КОЛЬСКИЙ НАУЧНЫЙ ЦЕНТР РОССИЙСКОЙ АКАДЕМИИ НАУК\"": {
        'code': '00557400000000000',
        'name': 'ФЕДЕРАЛЬНОЕ ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ НАУКИ ФЕДЕРАЛЬНЫЙ ИССЛЕДОВАТЕЛЬСКИЙ ЦЕНТР "КОЛЬСКИЙ НАУЧНЫЙ ЦЕНТР РОССИЙСКОЙ АКАДЕМИИ НАУК"',
        'nick': 'ФИЦ КНЦ РАН',
        'token': '1.2.643.5.1.13.13.12.2.51.9913',
    },
    "ФМБА ФГБУЗ ЦГ №120 г. Снежногорск": {
        'code': '00556900000000000',
        'name': 'ФЕДЕРАЛЬНОЕ ГОСУДАРСТВЕННОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "ЦЕНТРАЛЬНАЯ МЕДИКО-САНИТАРНАЯ ЧАСТЬ №120 ФЕДЕРАЛЬНОГО МЕДИКО-БИОЛОГИЧЕСКОГО АГЕНТСТВА"',
        'nick': 'ФГБУЗ ЦМСЧ №120 ФМБА РОССИИ',
        'token': '1.2.643.5.1.13.13.12.2.51.4993'
    },
    "Мурманская Городская поликлиника №1": {
        'code': '00559100000000000',
        'name': 'ГОСУДАРСТВЕННОЕ ОБЛАСТНОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "МУРМАНСКАЯ ГОРОДСКАЯ ПОЛИКЛИНИКА № 1"',
        'nick': 'ГОБУЗ "МГП № 1"',
        'token': '1.2.643.5.1.13.13.12.2.51.4981'
    },
    "ГОБУЗ кольская ЦРБ": {
        'code': '00556100000000000',
        'name': 'ГОСУДАРСТВЕННОЕ ОБЛАСТНОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "КОЛЬСКАЯ ЦЕНТРАЛЬНАЯ РАЙОННАЯ БОЛЬНИЦА"',
        'nick': 'ГОБУЗ "КОЛЬСКАЯ ЦРБ"',
        'token': '1.2.643.5.1.13.13.12.2.51.4987'
    },
    "МУРМАНСКАЯ ГП №2": {
        'code': '00559200000000000',
        'name': 'ГОСУДАРСТВЕННОЕ ОБЛАСТНОЕ БЮДЖЕТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "МУРМАНСКАЯ ГОРОДСКАЯ ПОЛИКЛИНИКА № 2"',
        'nick': 'ГОБУЗ "МГП № 2"',
        'token': '1.2.643.5.1.13.13.12.2.51.9802'
    },
    "ЧУЗ РЖД-Медицина г. Кандалакша": { # филиал Кандалакша ликвидирован 07.02.2024, правопреемник - ЧУЗ "РЖД-МЕДИЦИНА" г. Мурманск
        'code': '00557500000000000',
        'name': 'ЧАСТНОЕ УЧРЕЖДЕНИЕ ЗДРАВООХРАНЕНИЯ "ПОЛИКЛИНИКА "РЖД-МЕДИЦИНА" ГОРОДА МУРМАНСК"',
        'nick': 'ЧУЗ "РЖД-МЕДИЦИНА" Г. МУРМАНСК"',
        'token': '1.2.643.5.1.13.13.12.2.51.4998'
    },
}